# GetUpdaterName Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IUpdater..::..GetUpdaterName Method
IUpdater Interface See Also
---
Returns a name that the Updater can be identified by to the user
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
string GetUpdaterName()
```

Visual Basic
---
```text
Function GetUpdaterName As String
```

Visual C++
---
```text
String^ GetUpdaterName()
```

# See Also
IUpdater Interface
Autodesk.Revit.DB Namespace